{
    "title": "Bokutachi wa Benkyou ga Dekinai",
    "url": "https://myanimelist.net/anime/38186/Bokutachi_wa_Benkyou_ga_Dekinai",
    "id": 38186,
    "date": "Jul 2, 2019",
    "time": "6:38 AM",
    "recommendation": "Recommended",
    "rating": 8,
    "content": "\n                Highschool love stories have become something of the norm. Not only one of if not the most consumed genre in this medium, but also ar the easiest to relate to, with a large target audience that cherishes the fictional high school experience (We all went to the wrong high school apparently).\r\nThat was the most generic intro I could start this up with, but it has less to do with “Bokutachi wa Benkyou ga Dekinai” (quite a mouthful) or the busy, “We never learn”. Mainly because of how hard it tried to distinguish itself from what we get every season. Long story short, It did payoff.\n\r\n- Story (8/10):\r\nAt its very core, “We never learn” has one of the most basic stories that goes about a guy unconsciously raising a harem of girls from his high school, only this time around, there were no superpowers involved, no faith of humanity at risk, just a select of concerned passionate students that want to excel at what they do, with a great emphasis of comedy and goof-offs.\r\nNariyuki, a hard-working student tasked by the principle to tutor a duo of geniuses in his high school on materials that they're respectively bad at. The science genius red-head Ogata that wants to grasp a grip on literature, and the bookworm blue-head Fumino that wants to pursue a career in the scientific field. A short and a tall one, a flat and a garden-of-melons one (you get the idea), and trust me, the contrasts between them are much deeper.\r\nOf course, with time, other girls join in, Takemoto the athletic idol of the high school (Team Takemoto for the win by the way) and a couple of others, of which was the blessing of the season, enter, the almighty TILF, teacher Mafuyu.\r\nIt all starts genius and study-centered until the romance and pairings kick-off, and oh boy were day never-wreaking (in a good way)\r\nI find it genius how the show aired at the exact universal period of exams probably to relate to as much audience as possible. Aside from the main story that goes about the harem, the nostalgic atmospheric school vibes were too strong, the last time an Anime made me miss being a student was “Ansatsu Kyoushitsu” or “Assassination Classroom”. You get to feel their youth on both naive moments and not.\n\r\n- Art (8/10):\r\n2019 feels like a weird year for animation. A lot of studios given us the unexpected, there was a lot of disappointment for some as well. But “We never learn” didn't partake in none of those.\r\nPresented with the most generic slice-of-life-y art style that's good enough to keep you watching without complaint. Probably the best thing it had going for it visually was the consistency of the production. No episodes felt visually inferior, what you're used to is what you get, fair and simple.\r\nThe character design is just as average as the overall artboard, but the artistic choices are taken to influence said characters are striking, for example, a unique color that identifies every character based on their personality and mood. The proportion of the body is also a clever play on portraying everyone's treats.\r\nI don't like the direction they went with Nariyiki specifically, giving him the dull appearance with the very uninspiring brown aesthetic (talking mainly about the hair and eye color), but maybe that was the catch? He seemed like the center of the story to me, at least give him more of a better highlight.\n\r\n- Sound (8.5/10):\r\nI really got invested so much into the cast of voice actors and actresses, so much in fact that I can't imagine any other sound when I see the characters' faces.\r\nTakemoto's voice actress Suzushiro Sayumi is a fairly unpopular voice actress compared to most others, with very few roles in her experience, but God, her performance was a blast.\r\nThe opening song strikes a vibe of its own, making you feel like pulling off a high school material book and pretend you are preparing for an important exam in a group study at a summery day, it's just so surreal.\r\nThe ending theme song was not looking at the same direction as the opening, quite the change with a distinguishable tone and a more energetic pace, really well done too.\n\r\n- Character (7/10):\r\nI'm not as happy with this one as I would have loved to.\r\nDon't get me wrong, the characters are all unique individuals with their own stories to tell, but at what catch?\r\nIf anything, there was a huge lackluster in fleshing out the characters. They all received proper self-defining arcs, next episode, it feels like nothing was achieved.\r\nMost of the characters go through such length and bring out a new side and new thesis to tackle, but then it's like, “next”, good o'l switch a roo...\r\nWhat I'm trying to get to is, it's fine if you had a slow progressive story if you're going to sacrifice that to a more in-depth character arc that leaves its mark in the later episode. Now that I'm thinking about it, the only thing that changes is their level of affection to the main character, which is excusable for this show's case, but what about their dreams they keep bringing out?  Their past? Anything, please.\n\r\n- Enjoyment (9/10):\r\nI really had a blast, as short as I can phrase it.\r\nProbably one of the best Rom-Coms I watched, it did better than “Kaguya-sama love is war” in some aspects, and worst at others, both are great shows.\r\nIt's exactly the kind of show that makes me go “I want an OVA asap, or maybe a sequel if you're generous enough”.\r\nI don't think I'll be able to remember every name or every character in this show, but the hilarious moments and quotes shall forever be remembered.\n\r\n- Overall (8.1/10):\r\nThis is a really easy show to get into, definitely, a binge-watch material, even though I only experienced it in a weekly fashion.\r\nIf you're looking for a Rom-Com, you can start right off the bat and with no regrets, a lot of hilarious moments in the waiting, glorious misunderstood setups, and likable characters.\r\nThe main character doesn't make you spit slurs up every second, it feels like a chill series you'd want to watch after a long day of work in order to relax. Nothing beats the good old days of high school.\n"
}