{
    "title": "Noragami OVA",
    "url": "https://myanimelist.net/anime/20767/Noragami_OVA",
    "id": 20767,
    "date": "Jul 3, 2018",
    "time": "12:31 PM",
    "recommendation": "Recommended",
    "rating": 8,
    "content": "\n                First of all, do not attempt to watch this directly after or before the first season (Noragami), you MUST only watch these two episodes after seeing all first 6 episodes from the second season (Noragami Aragato), or else, major spoilers are going wrap. Make sure you watch the second episode of the OVA first, then the first. I know that's an odd order, but trust me, that's the right order to follow.\n\r\n- Story (7.5/10):\r\nPretty decent side stories for fun, no particular big plot surprise or anything aside from containing spoilers of the first 6 episodes of Noragami Aragato.\r\nThe first OVA resolves around Yato taking overHyori's body while he goes into a carefree spree around her school doing all sort of stuff in her name, with the rest of the folks trying to stop him.\r\nThe second OVA contains some major spoilers, but let's say the crew in its entirety goes on in a picnic, and have some actual fun until Yato pulls off a surprising highly-wished-for stunt.\n\r\n- Art (8.0/10):\r\nThe same slick and smooth art style and animation from the first season, really, nothing too spectacular and beyond decent I'd say.\n\r\n- Sound (8.0/10):\r\nI'm more happy to hear the first season's opening and ending theme songs, these OVA focused on a more comedic light hearted stuff, so there was no inclusion of the fantastic dark soundtrack, but the comedy makes up for that.\n\r\n- Character (8.5/10):\r\nI love the cast of these OVA, all lovable characters. and Hyori isn't as annoying as people see here so often. Everybody was easy going and invested in the comedy, good days to remember.\n\r\n- Enjoyment (9.0/10):\r\nAhh, the time went by like a fly, and that only happens when you're having fun. I really liked these side stories and hopefully, I get to see more of these soon because nothing can make up for the sad fact of you ending a spectacular show like this than having to see some extras.\n\r\n- Overall (8.2/10):\r\nI could actually highly recommend watching these, not like most OVAs who provide dead content, these ones had a lot to offer, and I'm specifically talking about a certain moment on the second OVA, god bless.\n"
}