{
    "title": "Guilty Crown",
    "url": "https://myanimelist.net/anime/10793/Guilty_Crown",
    "id": 10793,
    "date": "Jan 24, 2023",
    "time": "4:49 AM",
    "recommendation": "Not Recommended",
    "rating": 6,
    "content": "\n                Guilty Crown was a show that had a lot of potentials. The premise of a resistance group fighting against a tyrannical government in a post-apocalyptic world is a classic one, and the show's animation and music were certainly top-notch. Unfortunately, that's about where the praise ends.\n\r\nThe pacing of the show was painfully slow, with the first half of the series feeling more like a dragged-out setup for the real story. The characters were one-dimensional and bland, with the protagonist Shuu Ouma being nothing more than a typical shounen hero with no real development or depth. The show's attempts at making biblical references were cringy andfell flat, coming across as forced and out of place.\n\r\nThe story itself was riddled with inconsistencies and plot holes, with the show's second half devolving into a mess of convoluted twists and nonsensical plot developments. The characters' motivations and actions often made little sense, and the show's attempts at tackling heavy themes such as oppression and power were surface-level at best.\n\r\nEven the animation, which was one of the show's strengths, hasn't aged well over the past decade. The character designs and action scenes feel dated compared to more recent anime, and the animation as a whole comes across as stiff and uninspired. The only thing that \"Guilty Crown\" truly excels at is its music and OST, which are still some of the best out there. But even that isn't enough to save the show from its numerous shortcomings.\n\r\nWhen it comes to the characters of \"Guilty Crown,\" it's hard to find much to say that's positive. The protagonist, Shuu Ouma, is a prime example of this. He starts off as a socially awkward and unassuming high school student, but as soon as he gets his hands on the \"Power of the Kings,\" he suddenly becomes this overpowered, brooding hero with little to no character development. He's a classic case of a \"wish fulfillment\" protagonist, but without any of the charm or likability that often comes with that trope.\n\r\nThe same can be said for many of the other characters as well. Gai Tsutsugami, the leader of the Funeral Parlor, is your typical \"cool and charismatic\" leader of a rebellion, but he doesn't have much depth beyond that. Inori Yuzuriha, the female lead, is a bit more interesting, but her character arc is predictable and uninspired. The supporting cast is equally underwhelming, with most of them being one-dimensional stereotypes.\n\r\nWhat's even more disappointing is that the characters don't really have any chemistry with each other. The romantic subplot between Shuu and Inori is especially jarring, as it feels like it's thrown in just for the sake of having one, without any real emotional connection between the two.\n\r\nIt's a shame that such a big budget and effort was put into this series and yet the characters are so weak, it's hard to care about their plights. Even by the standards of anime a decade ago, these characters were not that well written. There were more for a cancer to this franchise than the Void virus.\n\r\nOverall: 6.68/10.\n"
}