{
    "title": "Naruto SD: Rock Lee no Seishun Full-Power Ninden",
    "url": "https://myanimelist.net/anime/12979/Naruto_SD__Rock_Lee_no_Seishun_Full-Power_Ninden",
    "id": 12979,
    "date": "Jan 26, 2023",
    "time": "4:24 AM",
    "recommendation": "Not Recommended",
    "rating": 4,
    "content": "\n                \"Naruto SD: Rock Lee no Seishun Full-Power Ninden\" or \"NARUTO Spin-Off: Rock Lee & His Ninja Pals\" is a spin-off of the popular series \"Naruto: Shippuuden\". The series follows the story of Rock Lee, a ninja who lacks the typically required abilities and has to compensate for this handicap with severe training and creative fighting techniques. The series is set in a super-deformed art style, which is a strange choice for a spin-off of a serious series like \"Naruto\". The series is also narrated by a narrator, which is an unusual element in an anime.\n\r\nOne of the major criticisms of the series is that itcould have been a canon adaptation of the original series, instead of a non-canon spin-off. Fans of the original series were disappointed that the series didn't follow the main characters and storylines of the original series. On the other hand, the series did give some screen time to Tenten, a character who was often overlooked in the original series.\n\r\nThe humor in the series is also a point of criticism, with many describing it as childish and repetitive. However, the ending song of the series is praised for being catchy and memorable. The series is also criticized for having episodes that are difficult to understand even for adults. It's juvenile, repetitive, and quite honestly, not funny. The jokes are often centered around bodily function and toilet humor, which can be inappropriate and off-putting for some viewers. The references in the series are also quite bad, often feeling forced and out of place.\n\r\nNot to mention, the main character Rock Lee is just plain annoying and his constant training and fighting techniques just get old quickly. I don't know about you, but I'd rather watch paint dry than sit through another episode of this hot mess. I can't even recommend it to die-hard Naruto fans, it's that bad. Save yourself the time and just stick to the original series.\n\r\nOverall: 4.4/10.\n"
}