{
    "title": "Dororo",
    "url": "https://myanimelist.net/anime/37520/Dororo",
    "id": 37520,
    "date": "Jun 28, 2019",
    "time": "4:09 AM",
    "recommendation": "Recommended",
    "rating": 8,
    "content": "\n                A kid exiled from their parents' warmth, only to deliver a harsh payback years later. A man meditates on top of a\r\nmountain, only to find out everything he was praying for had already faded away, stories of redemption, regret and\r\novercoming hardships like these give off a strange nostalgic vibe of a rainy night, embraced by your grandmother as she\r\ntells you about some urban legend whilst you're sipping from your warm bowl of soup, holding on to her on the rough\r\nparts of the story, waiting for the conclusion to drop so that you can fill up the lost bits of the story on your own\r\nlater, probablyas you dream hoping it doesn't turn into a fever hell. “Grandson/Granddaughter, shall we start?”, “Yes\r\nGranny, what are story are you going to tell us today, is it the bunny one?!”, mysteriously ignores you as she proceeds\r\ninto her storytelling; “A long, long time ago, demons existed, and a boy named Hyakkimaru was born...”\n\r\nA modern take on an already pretty established series, “Hyakkimaru” get mass attention from the fans on its airing\r\nseason, reviving its old forgotten stories, it founded a great following from both returning old and brand fresh new\r\nfans. A show like nothing we're used to especially lately, with gloomy colors, heavily traditional, and aggressively\r\ndark and controversial for its airing time.\n\r\n- Story (8.5/10):\r\nIn a world where demons have the superstitious upper hand, corruption is the common language, wars everywhere, famine\r\nevery day and genocide is a solution for everything. A samurai ruler sacrifices his newborn son for the demons in order\r\nfor his land to nourish, as his ruling mind convinced him that sacrificing a potential heir is a small price for his\r\npeople's salvation. Several demons reacted, each of them consumed something off of the poor little kid, and it just\r\nhappens that one of them fails at consuming whatever was left from a rusty skeleton and a mush of rotten flesh, no\r\neyes, no ears, no limbs and not even a healthy mind.\r\nGiven all the odds against him, he still survived under the care of a monk-looking doctor that has taken from providing\r\nprosthetic limbs for the dead and the sick a profession, a weird flex, but it only gets weirder from here on.\r\nHyakkimaru was the named given to the cursed poor kid, he had spent plenty of years under the care of the doctor until\r\nit was time for him to leave and walk his own path of restoring what was taken from him, defeating demon after demon,\r\nuntil that one day he met a mysterious kid. enter Dororo.\n\r\n- Art (8.5/10):\r\nIt was visually interesting, to say the least. It feels as if Dororo took the same old school art style every other show\r\nused back in the day, added in some seasoning by none other than the kitchen donkey himself and threw it on a plate for\r\nconsumption and that was probably the best thing to do for an old series such as it was, it definitely helped make it\r\neasier to watch through episode by episode.\r\nFor a seasonal series, it's disappointing how it lacked a definitive consistency through its serialization, some episode\r\nwere just the best out of all airing shows, whilst others did not scale up to the same standards, almost as if you were\r\nwatching a different show altogether.\r\nThe animation was, at the hight of it, breathtaking. For an action show, you bet you're getting a fight at least once an\r\nepisode, and for the major ones? Enter movie quality scenes, even for a couple of seconds. The hand to hand and\r\nswordfight feels natural and exciting, no such reusable snaps or slacking low-rate frames to drag down the rest of the\r\nproduction.\n\r\n- Sound (9/10):\r\nLet me get this right off the way first, the opening and ending songs in this show are party bangers, every single one\r\nof them. And I'm confident enough to call the first opening as the best in the crown, really inspiring and with great\r\nvocal cords, something you definitely don't see in every Anime. The ending theme songs are probably the least spoken\r\nabout on every show, and you can't help but understand why seeing how most people see them as skippable extra topping\r\nthat is just there to fill up the 24 minutes mark but not with “Dororo”.\r\nThe voice acting in this show is a little bit weird, I don't know if it's just me, but I can't help but feel a very old\r\nschool vibe from it, it's almost visible to the naked eye how for example, Dororo's voice feels like it was recorded two\r\ndecades ago, and it's not necessarily a bad thing, it just worked so well with everything else.\n\r\n- Character (8/10):\r\nFrom a newborn to a full-on adult. It feels like you've been raising a child on your own for decades, mostly because of how\r\nfrequently Hyakkimaru's personality changes as he wins something of his back, he may have never experienced hearing in\r\nhis life, but when he finally hears something, it just changes him, it flips his world, it influences his fighting\r\nstyle, it even alters his behavior and interaction to the world, and that was just an example of what a single sense does\r\nto him, and you can only imagine how different of a person he is at the end of the series from what he started off as in\r\nthe beginning.\r\nA lot of minor characters come and go, pulls off some plot-changing decisions and then disappear until they face the\r\nconsequences back.\n\r\n- Enjoyment (9/10):\r\nThis was definitely one of those shows that makes you feel empty after you finish it, you get too interested on a weekly\r\nbasis, and then suddenly it's the end. I'm not a big fan of how it ended, but I can think of a lot of other ways it\r\ncould have been bad, so I'll suttle with how it turned out for the sake of being faithful for what it set out for.\r\nI really enjoyed the fights, I enjoyed the characters, I loved the songs and the visuals, I wrote theories, I basically\r\nhad a phenomenal experience with the series, I felt connected, concerned, mild feelings of anger, happiness, and sadness, it was one\r\nheck of a rollercoaster.\n\r\n- Overall (8.6/10):\r\nAs someone who hasn't seen the original series yet (as of writing this review), I was definitely hooked. If I remember\r\ncorrectly, it was around the 5th or the sth episode were it all clicked for me, but going back, the first episodes were\r\nvery high quality too. I would definitely recommend diving into this series, especially for fantasy/mystery/action fans\r\nout there, watching the original does not really matter, it takes nothing out from the experience, and I would probably\r\nguess that it's the proper way to experience the series.\n"
}