{
    "title": "Ryo",
    "date": "Apr 19, 2018",
    "time": "10:22 AM",
    "recommmendation": "Recommended",
    "rating": 7,
    "content": "\n                Ryo was one of the four films of Anime Mirai 2013 (Young Animator Training Project), a project funded by the Japanese government's Agency of Cultural Affairs in order to support training animators.\r\nI stumbled upon a lot of sci-fi shorts following the same program, but this is a first for me, feudal Japan was always a great plot setting for me, I just love the mythologies and even the core culture itself, but with this short, I got more than I bargained for...\n\r\n- Story(7/10):\r\nThe story follows a young samurai boy who goes through a very warm yet unfamiliar experience after he lost his parent due towar that was caused because of the shaky relationship between Japan and England, the event all happen during feudal Japan, somewhere briefly the modern way of life has begun to expand throughout the world.\r\nYou really get to see the emotional state of the children that have no choice about their future but to become a literal killing machine, our Protagonist, who is named Ryo by this guy he idols, gets to experience the kind life that his master and father figure provides him with until of course, yet another time, a tragedy brings his newly formed family to the bedrocks.\n\r\n- Art (7.5/10):\r\nI'm found of this gloomy like atmosphere of a tone, it environment tend to lack the bright colorizations, but that really helps the morality of the story get some reveal, so no wonder, the characters anatomies are pretty realistic for such a stereotypical feudal Japan-centered show, it already reminds me of a great deal of other similar shows.\n\r\n- Sound (8/10);\r\nThe ambient soundtrack really does shine on this one, I can't help but feel to the characters when I hear those gentle yet cruel symphonies patting my ears, and the ending song is no difference, I miçght aswell download that work of art and have a listen to it daily, without shifting our focus to the voice acting, that aspect is really well done too, no overkill of any sorts, and of course, no complaints from me as well.\n\r\n- Character (7/10):\r\nThe sole problem for me was that most of the characters looked very similar to one another, I had a hard time distinguishing them apart, which really left me pausing the movie every now and then, which is, in fact, annoying and very distracting from the flow of the story, which is fast-paced.\r\nFor such a short animation, there was a great noticeable character development, the shy and silent boy you get to start the movie with is no longer the same by the end, one other cool thing is the unique character treats, remember how I nagged about how similar the main cast is? well, it was life-saving having to tell them apart by seeing how they act and speak.\n\r\n- Enjoyment (8/10):\r\nI'm a sucked for a good historical show, was it historically accurate or not, the opportunity to compare the current presentation with that of the past is just a lot of thoughts and wonders, and I'm all for that.\r\nI completely liked the flow of the story, it made me really wanna invest more time into a more episodic adaptation of this source material.\n\r\n- Overall (7.5/10):\r\nI most definitely not going to bring this one movie on my daily anime discussion, but if I had to pick a fast, easy to follow feudal Japan show, this one will probably slip unconsciously from my mouth, It's still a decent show, very short, no emphasis or anything, but if you had some spare time for another refreshing story, here's one for you.\n"
}