{
    "title": "Mushoku Tensei: Isekai Ittara Honki Dasu Part 2",
    "date": "Jan 19, 2023",
    "time": "9:28 AM",
    "recommmendation": "Recommended",
    "rating": 9,
    "content": "\n                If the first cour did not carry the crown the second cour definitely lived up to the \"forefather of modern Isekai\" title.\n\r\nThe story takes up right where the first court left off. Again, perfect pacing, no wasted time on reaction shots, and showing the same plan cup of tea from different angles over boring dialog. The openings and endings maintained the same force and vibe which is just fine and the animation, contrary to popular belief, surpassed what even the first cour had going for it.  The \"Bread scene\" is a prime example of this.\n\r\nThis season really was what I wanted the first courto be, it had everything matched up. But maybe it is because the first cour had a steady and consistent build-up to the climaxes this cour had. The characters are much well grounded, they are better developed, their bonds are more interesting and their motivations are clearer.\n\r\nThe world-building in this cour is also top-notch. The Demon continent is a vast and mysterious place, filled with all sorts of dangers and secrets. The way the story slowly unfolds and reveals more and more about this world is masterfully done, and it keeps you on the edge of your seat. The fact that the story takes place in a demon world also adds a whole new layer of depth and intrigue to the narrative.\n\r\nThe characters in this cour are also a huge step up from the first cour. The dynamic between Rudeus, Eris, and Ruijerd is just amazing. They all have their own unique personalities and motivations, and their interactions with each other are just so fun and engaging to watch. Eris especially stood out to me, her character arc is just so compelling and it's amazing to see her grow and develop over the course of the cour.\n\r\nThe culmination of these two courses really makes it so hard to go back to the old mediocre copy-paste Isekai shows that seem to rain down in the masses every season. We are witnessing the making of something special here and it's about time some change was introduced to the medium.\n\r\nOverall: 9.6/10.\n"
}