{
    "title": "High School DxD New: Oppai, Tsutsumimasu!",
    "date": "Jul 6, 2018",
    "time": "4:30 AM",
    "recommmendation": "Mixed Feelings",
    "rating": 6,
    "content": "\n                If the parent series was a cake, this OVA would be the topping, and what a sweet topping that was!\n\r\n- Story (4.0/10):\r\nOnce again, a short animation with no important plot progression, very stereotypical, a bad guy appears and starts stealing women panties, that's where the club's members have to intervene and save the day, but of course not before every woman ever gets violated and Issei has a yet wonderful view.\r\nLike many other Highschool DxD OVAs, the villain is just as perverted as Issei, and thus, Issei sympathizes with them, saving the day with a yet legendary quote, a mighty pervert has never spoken ofbefore.\n\r\n- Art (7.5/10):\r\nWith nothing fantastic about it, the same old art style and animation quality spanning this OVA. But at least, you have got to appreciate the physics that only seem to get funky the closer you get to one's chest, oddly enough, works only on female characters.\n\r\n- Sound (7.0/10):\r\nNothing that makes you go “Wow”, I love the outro, the same one from the parent story, however, the second opening theme song hadn't aged quite healthy in my memory.\n\r\n- Character (5.0/10):\r\nI would have given this a 4/10, but you gotta have some extra points for the minimalistic screen time for the great Azazel.\r\nAll the characters didn't have anything to add to this episode, aside from getting violated.\n\r\n- Enjoyment (7.5/10):\r\nNot the best highschool DxD OVA out there, probably because of the focus on underwear? and like Issei said, it's about what's under the underwear, not specifically them, they are nothing but a support for the magnificent support they provide for.\n\r\n- Overall (6.2/10):\r\nI had higher expectations for this OVA, but while not being too terrible, I managed to get some giggles with sometimes spacing out because nothing too interesting was happening. I would recommend watching this, because it's more like a 13th episode for the second season, if you're in for the fanservice, then you're differently going to love this, but if you're like me, a man of culture but also has interest in the plot, you could skip this as it has no ties to the main plot, but skipping an episode might end up in you having some regrets, because one day, you'll finish seeing all of the episodes, and probably want more, but there are no episodes left, so take this chance if you're comfortable, and have fun.\n"
}