{
    "title": "Black Clover: Jump Festa 2016 Special",
    "date": "Sep 5, 2018",
    "time": "1:18 PM",
    "recommmendation": "Mixed Feelings",
    "rating": 6,
    "content": "\n                As a complete stranger as I can be, with no prior knowledge or interest in the source material or the parent series, I decided to have this OVA be my gate, my decision about whether to watch the main series out of curiosity.\r\nThis is a totally honest point of view of a newcomer that doesn't know how good or bad the source material is, so cut me some slack. “Black Clover: Jump Festa 2016 Special” presents a preview of what the main anime adaptation was going to be like, hitting at some major plot points, and introducing the setting of the story in a waythat personally was fascinating.\n\r\n- Story (6.5/10):\r\nIn a world where magic is everything, a world ruled by the magic emperor who under him serves all of humanity. With an annual ritual that has 15 years, old kids gather in order to be given their personal Grimoire, a mage book that only them can use. Asta and Yuno, two orphan childhood friends make their way to the event, while Yuno gets his legendary Grimoire that resembles the first emperor's, Asta was let down and never got his own Grimoire, making him ridiculed in front of everybody, but not until he accidentally somehow awaken his true powers, and gets an even more high-class legendary Grimoire of his own in the most cliché way possible. I bet you've got to at least have heard of a similar synopsis. A lot of people accuse the writer to have plagiarised the Naruto and Fairy Tail, but it is faintly noticed that it tries to remain as original as it can. The humor wasn't the best aside from some unexpected weird expressions. The pacing was good at most, showing you a glimpse of different things, and the backstory was simple and harmless at work.\n\r\n- Art (7.8/10):\r\nNot what I'd call a superb one. The CGI parts were just horrible, and the art style was being conflicted sometimes like a hybrid of many other art styles. The character's eyes looked uneven and weird, especially Asta's, and generic background crown couldn't look more generic. The color palette reminds me a little bit of Skyrim for how gloomy and medieval it sounds, it makes perfect for the probable era the setting is set up at.\n\r\n- Sound (5/10):\r\nI had a light headache before watching this one, and Asta's voice only made it worse. The guy doesn't know how to catch a break. Some other voice actors sound very forced, boring or over-dramatic. The soundtracks weren't as noticeable or anything, I just can't think of something good to praise here.\n\r\n- Character (6.5/10):\r\nI was eager to reach this stage, Asta, how do I put it. The emperor of magic? more like the emperor of quibbling, constant screaming and nagging, dude, take it easy. And then there is Yuno, the classic hot, claim semi-emo boy that give you the expectations of him turning a villain at some point. I couldn't give more attention to other characters are the special went deep with the relationship of Yuno and Asta backing their feelings up.\n\r\n- Enjoyment (8.0/10):\r\nAs much flaws as it had, it really picked interest for me to check out the main series, it's been a long time since I last saw Naruto, so even if it was a straight up copy-pasta I would still like to keep up with this longer and see where it's headed. I like the lore that can be milked from mage stories, and the medieval setting overall just feels nice to see other than the Isekai stuff.\n\r\n- Overall (6.8/10):\r\nI believe that for newcomers that are interested in watching Black Clover, this can serve as a better replacement for the 3 episodes rule most of the people tend to rely on in determining whether to finish a show or not. It introduces a lot of aspects of the series very briefly and effectively and was overall a mediocre sneak peak on the world of Black Clover.\n"
}